[
  "The mission of Student Counselors for Social Justice is to provide community, connection, training, and empowerment for student counselors across Northwestern who are interested in social justice and advocacy action.",
  ".dev is\\u00a0the essential club for students who want to get into tech. \r\n\r\nEvery year we hold a project competition, competitive programming events, workshops, and a hackathon. \r\n\r\nWe also host company info sessions and exclusive events with guest speakers.",
  "Located on the south side of campus near downtown Evanston, 1838 Chicago/Shepard/Allison (previously home to PARC Residential College) houses 120 students. ",
  "3D4E is a student organization dedicated to bringing the experience of imagining, designing, and creating with 3D Printing and Computer Aided Design to all students of any skill level.",
  "Kemper Hall is on north campus and houses 165 students in singles and doubles, arranged in a closed suite-style layout.",
  "64 Squares Chess Club is dedicated to promoting chess in the Northwestern community by providing a comfortable and fun chess-playing environment. ",
  "A&O Productions, one of the largest student groups on campus, has provided Northwestern University undergraduates with top-notch large-scale entertainment programming since its inception in 1969. ",
  "Academy of Music and Art for Special Education (AMASE) teaches individuals with disabilities to engage with music and arts on Saturday mornings on campus.",
  "NUAM is the primary mental health awareness and advocacy group at Northwestern. We focus our efforts on informing students about mental wellness, creating a dialogue surrounding mental health and illness, and reducing the stigmas associated with it.",
  "ADCA introduces advanced degree students at Northwestern to alternative careers outside academia or their respective disciplines. We also provide tools and resources to help our members realize their professional career goals in consulting and beyond.",
  "Advancement for the Undocumented Community (AUC) is a student organization dedicated to providing resources and support for undocumented student and students with undocumented family members. ",
  "ASA is a student organization for African students and those interested in African culture. Our main goal is to create and sustain community for those interested in engaging African culture.",
  "African Dance Troupe at Northwestern University to promote African culture by showcasing traditional and modern African-themed dance moves and music.",
  "We are a non-competitive South Asian fusion dance team that hopes to provide dancers with a space to learn, grow, and create. By fostering a community that celebrates its strengths, we will encourage dancers to share their ideas and choreography.",
  "Present in over 2400 universities in 127 countries and territories, AIESEC's international platform enables young people to explore and develop their leadership potential for them to have a positive impact in society.",
  "The Northwestern Aikido Club is a student club dedicated to the study of the martial art, aikido. Aikido is a dynamic, powerful and graceful art founded early in the 20th century. Aikido training teaches both defensive techniques and traditional weapons.",
  "Northwestern's premier business fraternity.\r\n ",
  "The Alexander Hamilton Society (AHS) is an independent, non-partisan, not-for-profit, membership organization dedicated to promoting constructive debate on basic principles and contemporary issues in foreign, economic, and national security policy.",
  "TBA",
  "Alianza aims to unite and support its members towards an advancement of an empowered, productive Latinx presence at NU; Alianza is a cultural, educational, and social programming body. ",
  "All Ears aims to bring together undergraduates who are passionate about volunteering in a clinical setting. Undergraduate students will have an opportunity to pair up with medical students and visit patients to provide companionship for chronic patients.",
  "AAS unites students by creating spaces for critical discourse on current events in and in relation to Africa. In order to challenge perceptions of Africa, we contextualize & interrogate dominant narratives and bring to the fore Africana activists.",
  "The Alliance of Chicago Minority Students (ACMS) seeks to foster camaraderie and establish a support system among graduate and professional students of underrepresented minority populations on the Northwestern University Chicago campus. ",
  "Allison Hall is on south campus and houses 363 students in mostly doubles and three triples, arranged in a traditional-style layout. The rooms are among the largest on campus.",
  "Alpha Chi Omega is a national women's fraternity that aims to enrich the lives of both collegiate and alumnae members with opportunities for friendship, leadership, learning and service. ",
  "Tau Delta Chapter, Northwestern University 584 Lincoln St. Installed November 11, 2000 Chapter President: Joey Becker Organization Facts National Founding Date: November 7, 1913 Colors: Gold, blue You may visit the national website at www.aepi.org",
  "Beta Chapter, Northwestern University 701 University Place\r\nInstalled 1881\r\n\"Union hand in hand.\"\r\nOrganization Facts\r\nNational Founding Date: 1872\r\nColors: Silver, Bordeaux",
  "Alpha Mu Chapter, Northwestern University\r\nInstalled October 21, 1922\r\n\"First of All, Servants of All, We Shall Transcend All.\"\r\nPresident: Adam Montgomery\r\nOrganization Facts\r\nNational founding date: December 4, 1906\r\nColors: Black, Old Gold",
  "APO is a gender-inclusive national service fraternity with open recruitment at the beginning of every quarter. Members focus on planning and participating in a variety of community service activities as well as fellowship activities. ",
  "Alpha Psi Lambda was established on February 11, 1985, at The Ohio State University.  We believe in the concept of Familia to create a support network for our members while creating the real-world experience of working with anyone.",
  "Alternative Student Breaks sends students to volunteer sites across the nation during academic breaks.",
  "The American Medical Women\\u2019s Association Northwestern University chapter aims to foster an enriching environment for women in science and the medical profession.\\u00a0 ",
  "We are the Northwestern student chapter of the American Society of Civil Engineers, a professional society dedicated to advancing members' goals and passions in civil engineering.",
  "tba",
  "We are a group of students that go down to the Juvenile Temporary Detention Center (JTDC) in Chicago to mentor residents through creating hip-hop music through Garage Band.",
  "TBA",
  "Applause for a Cause annually produces and premieres an original feature-length film, in support of an annually-selected philanthropic organization.",
  "Arch Society members act as student ambassadors of the Northwestern Alumni Association. We support and develop university-related programs and community-wide events to strengthen the relationships between alumni, students, faculty, and staff.",
  "We're a co-ed sports club practicing recreational and competitive archery. People of all experience levels are welcome. We provide training for beginners, 1-on-1 coaching for serious competitors, and equipment & an archery range for all!",
  "Area Councils are student-led organizations that serve as the hall-governance for Northwestern\\u2019s residential communities.",
  "Aroma Tea Club is a multicultural organization that aims to provide an open and friendly environment for the Northwestern community to learn about tea and tea culture.",
  "Art Union is Northwestern\\u2019s premier art club.\r\nWe aspire to promote and develop a community of Northwestern artists, helping to nurture relationships, artistic skills, and various talents from a diverse network of students, through intentional art-making.",
  "ARTivate is a community arts engagement initiative that aims to use art to create a more diverse and interconnected community, provide safe spaces, and empower individuals to express and use their voices through art.",
  "Arts Alliance creates art that reflects, deepens, and challenges the Northwestern community. We provide a positive atmosphere in which students can learn and work alongside a committed and supportive board to create professional-quality productions. ",
  "Asian American InterVarsity is a group of students and staff who strive together to grow in love for God, his Word, his people, and his purposes in the world. We seek to be a witnessing community to the Asian and Asian American community at NU.",
  "From our unique position as similarly racialized peoples, Asian Pacific American Coalition builds community and power, in addition to raising awareness of historical, social, and political issues that affect marginalized communities at large. ",
  "ASG is the Associated Student Government of Northwestern, a group of undergraduate students devoted to working on behalf of the Northwestern community.",
  "Network and Advocacy Group for Women in the Sports Industry",
  "ALPFA (Association of Latino Professionals For America) is the first national Latino professional association in the United States, established in Los Angeles in 1972. =",
  "The purpose of our organization is to provide a space for woman-identifying and nonbinary\r\nstudents who are pursuing studies in the sciences at Northwestern.",
  "Asterik is Northwestern's premier all male range voices a cappella group, founded in 1994.",
  "Athletes in Action is a interdenominational Christian ministry. We desire to provide every athlete at Northwestern an opportunity to hear how they can know God through Jesus Christ. We are committed to do this as a community. ",
  "The Department of Athletics and Recreation: Fitness, Aquatics and Recreational Sports oversees the sport clubs on campus. ",
  "ASC has a mission to decrease the environmental footprint of the Northwestern Department of Athletics and Recreation by increasing awareness among  students, athletes, staff, and fans and reducing waste within practices, games, and facilities.",
  "Aviation Club is Northwestern's only student organization dedicated to the social aspects of aviation. Dedicated to helping people expand their knowledge of and interest in aviation, we host a variety of meetings, events and trips each quarter.",
  "Thomas G. Ayers Hall is on north campus and houses 170 students in mostly double-occupancy and a very limited number of single-occupancy rooms, arranged in a traditional-style layout. Men and women live in separate wings of the same floor. This building ",
  "A dance interest group for students of color to learn and perform burlesque dances!",
  "Club Badminton provides court space for undergraduates, graduate students, professors, and the general public of all skill levels to play badminton. We also have an annual tournament with the University of Chicago. ",
  "Once a month, NU students of all backgrounds come together to discuss some of life's deeper questions, share their unique perspectives, eat home-cooked Persian food, play competitive games, and have a good time!",
  "The Baja SAE team is a team of undergraduate students who design, build and race an all-terrain vehicle each year. Students are challenged to pull all their engineering knowledge and skills together to engineer a safe, functional racing machine. ",
  "The goal of BSA is to promote the cultures and languages of the Balkan countries by creating a space where individuals who originate from the Balkan Peninsula and individuals who are interested in our region can connect easily and build a community.",
  "Ballet Folkl\\u00f3rico Mexicano de Northwestern: Ritmo de Mis Ancestros (Rhythm of My Ancestors) is a traditional Mexican dance group dedicated to spreading folklore music and dance on Northwestern's campus and the surrounding community. ",
  "BLAST, short for \\u201cBallroom, Latin, and Swing Team\\u201d, is a partner dance organization committed to creating a community for all levels of dancers. We provide quality instruction alongside competitive, social and performance dance opportunities",
  "Be the Match aims to register students and faculty for the national marrow donor program, and raise awareness of the minority ethnic groups that are underrepresented within the registry. ",
  "Best Buddies is an international nonprofit organization dedicated to enhancing the lives of those with intellectual and/or physical disabilities by providing opportunities for one-to-one friendships, integrated employment, and leadership. ",
  "Bhakti Yoga Society provides students the opportunity to experience yoga and spiritual culture from ancient India through a blend of yoga classes, small group discussions, guided meditation sessions and more! ",
  "An organization that helps connect the student body of Bienen to the faculty!",
  "Biology Students Association (BSA) at Northwestern seeks to connect students with a common interest in biology, provide a forum for discussion, and bridge the gap between textbook knowledge and real-world science.",
  "The Biomedical Engineering Society at Northwestern University brings together biomedical engineering students and faculty members to promote academic, professional, and social collaborations.",
  "The purpose of the Biomedical Informatics and Data Science (BIDS) Student Group is to create a community for biomedical informatics and data science students across Northwestern University\\u2019s Evanston and Chicago campuses. ",
  "Black formal organizes a yearly formal in celebration of the Black community, and seeks to fulfill the needs expressed in the Black Student Experience Report.\r\n",
  "Founded in 1996, the Black Graduate Student Association (BGSA), a graduate student organization within The Graduate School (TGS), aims to support the academic, professional, and social growth of graduate students of color from underrepresented groups.",
  "The Black Mentorship Program (BMP) is a mentorship program for Black identifying undergraduate students at Northwestern.",
  "BlackBoard Magazine is Northwestern University\\u2019s historically Black student publication. \r\n",
  "The BSAB seeks to bring a multifaceted range of students into the museum to develop new ways to engage the student body and the local arts community through planning and marketing creative events inspired by the museum's exhibitions and collection. ",
  "NU Blockchain Group is an undergraduate group aiming to foster a healthy ecosystem surrounding Blockchain technology on campus through a series of workshops, speaker events, and development projects. ",
  "North Campus Residential Living Facility",
  "Boomshaka is Northwestern's premier drum, dance, and rhythm ensemble. Entirely student written, directed, and produced, Boomshaka has established a reputation for consistently delivering energetic and inspiring performances. ",
  "Our organization aims to educate the student body on the importance of bee conservation as well as provide a space in which students can collaborate and communicate to achieve a greater goal.",
  "The NU Brain Awareness Outreach (NUBAO) organization is a graduate student-led public outreach initiative dedicated to educating, exciting, and inspiring Chicago area youths about the brain and the progress and benefits of neuroscience research. ",
  "BEI is a volunteering organization that helps patients with Alzheimer's by using simple math, writing, and reading exercises to decrease the rate of disease progression and improve that cognitive function.",
  "BRASA strives to engage the Brazilian community at Northwestern, integrate it with the community of Brazilians studying abroad, as well as to promote Brazilian culture, social life and pre-professional opportunities on campus.",
  "Northwestern's Bridge Club. Come play with us! All levels welcome!",
  "Bridge Out\\u2019s purpose is to serve as a bridge from the Northwestern campus to non-profit organizations in the Chicago area. ",
  "Brown Sugar is the nation's premiere South Asian-interest co-ed a cappella group. ",
  "CCAC aims to share and celebrate Cambodia's rich culture, history, and cuisine through fun activities such as field trips to museums and cooking sessions. Hence, if you (all students) are interested to learn more, we're very excited to have you join us!",
  "Camp Kesem is a nonprofit that organizes a free summer camp for children who have been affected by a parent's cancer.  \r\n\r\nFill out this form if you're interested in joining: https://forms.gle/X5mQTa3EL9vQ64cA6",
  "Campus Curlz is a natural hair and service-based organization whose goals are to enhance, educate, and uplift those on campus and in the community through educational support and service. \r\n\r\n",
  "DCIC is dedicated to collaborating with students, faculty, and staff with the aim of making Northwestern University an inclusive community for all Wildcats. DCIC's primary goal is to cultivate a community of respect at NU.",
  "campusCatalyst is a student group and Kapnick Business Institutions Program class at Northwestern University that engages college students, supported by business school mentors, in high-impact pro-bono consulting for nonprofit organizations.",
  "We're the Episcopal campus ministry. Through communion and community, we offer students a place to explore issues of vocation, social justice and spirituality -- where the life of the mind meets the concerns of the soul and the needs of the world.",
  "TBA",
  "Northwestern's Caribbean Student Alliance is an organization for students of Caribbean descent, as well as all members of the NU community who are interested in the dynamic culture. It seeks to explore and preserve the culture through programming.",
  "Are you interested in practicing Portuguese and learning about lusophone cultures? Carnaval is a space for language learners to have conversations and build on their knowledge. We put on fun and informative cultural events.",
  "The mission of CARE is to create a culture of healthy sexuality at Northwestern University where sexual violence, relationship violence, and stalking are not tolerated",
  "Northwestern University's Center for Civic Engagement promotes a lifelong commitment to active citizenship & social responsibility. CCE integrates academics with meaningful service, research and community partnerships to promote a more engaged university",
  "tba",
  "Welcome to Chair-ity! We're a fledgling group dedicated to connecting topical, charitable causes to traditions and lasting experiences for any first-year (or upperclassmen) students that wish to take part\\u2013with a unique focus on \"the Chair.\"",
  "If you like to bake, eat, or volunteer, Challah for Hunger is for you!! Challah for Hunger (CfH) raises awareness of and money for hunger and disaster relief through the production and sale of challah bread. ",
  "The Humanities Residential College.",
  "Chi Alpha (or XA) is a Christian campus ministry focused on allowing students to grow together in their experience with God, community, and mission.",
  "Xi Chapter, Northwestern University 1870 Orrington Ave\r\nInstalled: 1901\r\nChapter President: Emma Brick\r\n\r\nYou may visit the Xi Chapter's website at  www.chiomegaxi.com\r\nOrganization Facts\r\nNational Founding Date: April 5, 1895\r\nColors: Cardinal, Straw",
  "Our mission is to promote scholarship, research, professionalism, leadership, advocacy, and excellence in counseling, and to recognize high attainment in the pursuit of academic and clinical excellence in the profession of counseling.",
  "For more information check out our website: http://sites.northwestern.edu/cgsa/ ",
  "The Chicago Urban Program is a Pre-Orientation Program for first year students the week before Wildcat Welcome. CUP is an introduction to the neighborhoods in Chicago through service, arts, and culture. ",
  "China Care is a cultural philanthropy group who helps to fund surgeries and education for Chinese orphans with disabilities and provides programming for adopted Chinese children who live in the Chicagoland area.",
  "Welcome! We are a student group that supports health initiatives in Cermak Chinatown. Get involved by volunteering as an interpreter or joining the student board.",
  "Formed in 2009, the Chinese International Student Association is a cultural club that welcomes international Chinese students and all friends who are interested in Chinese. It aims to promote the authentic Chinese culture on campus.",
  "Northwestern University Chinese Students and Scholars Association (NUCSSA) is a student organization dedicated to promoting social, intellectual and cultural activities for Chinese students and scholars. ",
  "The Chinese Students Association is one of the first established Asian-American student groups at Northwestern. We aim to promote the awareness of Chinese culture on campus and elsewhere while encouraging a social environment for students of all ",
  "The Christian Science Organization has supported practical, healing spirituality at NU since 1926. The CSO welcomes both active students of Christian Science and the broader community as we explore campus and global issues through a spiritual lens. \r\n\r\n",
  "Christians on Campus is a campus group comprising of believers in Christ from various backgrounds. We warmly welcome all Christians in Christ, and reach out to the greater Northwestern community. ",
  "TBA",
  "Circle of Women is an international student-led organization that supports girls' education in developing countries. We partner with local NGOs all over the world to work on projects, and plan events to fundraise and spread awareness. \r\n",
  "NU Club Baseball is the best way to continue playing competitive baseball after high school. We practice two to three times a week year-round, and have games during the fall and spring. Tryouts will occur within a week or two of class starting.",
  "Northwestern's official club cricket team, open to all undergraduate, graduate and faculty members. ",
  "Club Field Hockey is open to athletes of any skill level. The recreational, yet competitive nature of the club will enable members to enjoy the sport through training sessions, away games, tournaments, and bonding events.",
  "The Northwestern Figure Skating Club consists of the NU Synchronized Skating Team as well as an individual freestyle skating program. Members have the opportunity to continue figure skating in college and experience collegiate-level competition.",
  "Club Golf was re-formed during the 2013-2014 school year.  We will be playing recreationally at local courses as well as competitively in regional tournaments.  Club Golf was created so give students a chance to play competitively and recreationally. ",
  "Northwestern Club Softball is a competitive, collegiate girls' fastpitch softball team. We are a member of the National Club Softball Association and play teams generally located in the Midwest region. 2019 was our 1st appearance at the national tourney.",
  "We are a team dedicated to competing in the sport of Spikeball roundnet and providing a supportive community for Northwestern students.",
  "Club Tennis is a group for students who want to continue playing tennis at a competitive level, but in a more recreational environment. ",
  "Practice:\r\nGenerally M-TH 8:30-10:00 at SPAC\r\nThree tourneys in the fall finishing with the Big Tens Champ (Men's League)\r\nHome tourney winter quart\r\nThree tourneys in the spring finishing with the Big Ten Champ (Women's League)\r\nTennessee trip in April",
  "TBA",
  "TBA",
  "The NU College Democrats serves as a campus hub for progressive thought and action. We hold weekly meetings on campus, discussing current events, debating progressive ideals and policy, and, most importantly, building a strong community.",
  "College Feminists is a premier feminist and pro-choice organization on the Evanston Northwestern campus. Email nufeminists@gmail.com to find out when we meet. New members are always welcome!",
  "College Republicans is Northwestern's conservative student organization that supports the ideals of the Republican Party. We host high-profile speakers, participate in campus debates, and provide a variety of opportunities for all political backgrounds.",
  "The Colloquium on Indigeneity and Native American Studies is an  academic endeavor that aims to promote and stimulate conversations on indigeneity and indigenous populations in the Americas and the transnational imaginary at Northwestern. ",
  "East Fairchild is on south campus and houses 109 students in single- and double-occupancy rooms, arranged in an open suite-style layout. Men and women live in suites clustered by gender. This building is available to all undergraduate students.",
  "Community Health Corps is a student group dedicated to improving health outcomes in the Evanston and Skokie area by increasing access to health information and resources.",
  "TBA",
  "TBA",
  "Started in the spring of 2008, CASE is a student organization at Northwestern University dedicated to providing pro bono consulting advice to Northwestern-based organizations. Our work is grounded in our belief in the power of Northwestern University ",
  "The CTSS invites the most influential and forward-thinking minds of our time to speak to the Northwestern community on issues of universal importance. Our mission is to encourage cross-campus dialogue and intellectual community at Northwestern.",
  "Cookology is established to provide opportunities for Northwestern students to explore cooking techniques, recipes, and ethnic cuisines and cultivate interests in culinary arts through student-run restaurants, cooking lessons and catering events.",
  "C.O.P.E. unites and empowers college students in their initiatives to fight cancer through public awareness, fundraising, and patient support (volunteering) for a variety of cancer-related organizations. It is a group devoted  to developing leadership, ",
  "Encountering Christ with boldness & humility.\r\nGrowing in faith through life together. \r\nInviting all to God's table. \r\nCommitted to love.\r\n\r\nWe meet every Sunday morning at 10 am in the Great Room.\r\n\r\n(Formerly Church of the Redeemer)",
  "We provide a platform for all the students and scholars from Northwestern University to discuss and explore issues on current economic, political and cultural situations, as well as to catalyze further understanding of business and economy relations ",
  "Just your local crossword crazies. Our focus is building a community on campus for meeting new folks and having fun with crosswords. We also contribute weekly crosswords in the Daily Northwestern.",
  "NUXW is a co-ed team equally focused on improving our crossword skills and building a friendly, supporting community on campus. ",
  "What is Cru about?\r\nReal faith. Real relationships. Real life.\r\nNorthwestern Cru is a community where the gospel captures hearts, transforms lives, impacts the world and launches men and women into a lifelong adventure with Jesus Christ. ",
  "CURE (Competition for Undergraduate Regenerative Engineering) is an engineering student research group designed to tackle medical challenges with regenerative engineering solutions. We use model wound systems and hands-on methods for applicable research.",
  "Northwestern Cycling is a co-ed club sport open to both undergraduate and graduate students who enjoy riding their bicycles. The team organizes group rides of varying distance and speed throughout the year and competes in collegiate races in the spring.",
  "Dale Duro is looking to create an inclusive community for all students searching to enrich their appreciation for Latin culture through dance.",
  "Dead City Productions is a group of Northwestern students, alumni, and their guests who enjoy live-action roleplaying, strategic board-gaming, and other forms of gaming. We are open to anyone interested in participating \\u2014 no experience necessary!",
  "TBA",
  "Deeva is a nationally-recognized, all-female competitive dance team that blends the best of Indian classical, Bollywood, folk, ballet, lyrical, and hip-hop, founded in 2001.",
  "Founded as a law fraternity in 1890, Delta Chi was established at Northwestern in 1893. The transition from a law fraternity to a general-membership fraternity forced the Northwestern chapter to close in the 1920s, but recolonized in 1997.",
  "Upsilon Chapter, Installed 1895\r\n\"Let us steadfastly love one another.\"\r\nChapter President: Marianna Cooper\r\nFor more information visit: \r\nhttp://northwestern.tridelta.org",
  "Sigma Chapter, Northwestern University 618 Emerson Street\r\nInstalled 1882\r\n\"Do good.\"\r\nChapter President: Samantha Zabell\r\nYou may visit the Sigma Chapter's website at  http://www.deltagammanorthwestern.9k.com/index.html.\r\nOrganization Facts and Awards",
  "As the world\\u2019s leading professional fraternity for men and women, Delta Sigma Pi develops principled business leaders for the future by providing a lifetime of opportunity for members.  ",
  "The Theta Alpha chapter has been serving the Northwestern Community since January 9, 1971. Since that date, women of the Theta Alpha chapter have taken a vow to serve their Northwestern community using the same founding principles of the Sorority. ",
  "TBD",
  "Northwestern Chapter, Northwestern University 2307 Sheridan Rd.\r\nInstalled October 27, 1880\r\n\"Justice our Foundation.\"\r\nChapter President:  Will Gomez-Moller\r\nYou may visit the Northwestern Chapter's website at  ",
  "Alpha Alpha Chapter, Northwestern University 717 University Place\r\nInstalled 1920\r\nChapter President: Zoe Harding\r\nYou may visit the Alpha Alpha Chapter's website at https://www.nudeltazeta.com/\r\n\r\nNational Founding Date: 1902",
  "Design for America creates local and social impact through design. By organizing interdisciplinary groups of students and working in an extra-curricular setting, we tackle social challenges from a unique, creative perspective.",
  "A mentorship program working with local Evanston schools to build connections with young women and build them up for success.",
  "A spiritual resource for Latinx-identifying Northwestern students seeking to know God and develop or enhance their relationship with Jesus. Our goal is to cultivate Latinx students' interest and faith in God. \r\n",
  "DISC has the goal of expanding Northwestern students' perceptions of the capabilities of technology. Since then, we've gathered a diverse group of student leaders interested in using technology to make a positive impact on the world.",
  "N/A",
  "DIBS is an organization committed to fostering a community for underrepresented minorities (URM) and LGBTQ students within IBiS. This includes increasing resources for URM/LGBTQ students and advocating for an inclusive environment. ",
  "The Dolphin Show is a non-profit student theatre organization that annually produces the nation's largest student-run musical.",
  "The DGP Student Council brings the concerns of students to the DGP administration and fills programming gaps in the areas of mentoring, social and research activities.",
  "Elder Residential Community is on north campus and houses 345 students in mostly double-occupancy and a very limited number of single-occupancy rooms, arranged in a traditional-style layout. Men and women live in separate wings of the same floor. This ",
  "Engelhart Hall apartments are open to all Northwestern graduate students, their partners and families.",
  "EWH NU seeks to inspire and mobilize students to improve the quality of healthcare in vulnerable communities. It provides members of NU EWH with the opportunity to repair, build, and learn about medical devices in the developing world.",
  "ESW empowers students to take on leadership roles in applying the principles of sustainability to their present and future work through action-based engineering projects and the education of ourselves and our community on sustainability topics.",
  "The mission of EWB-NU is to engineer and implement solutions that enrich the lives of communities and meet basic human needs through the completion of educational and collaborative projects \\u2014 both locally and abroad.",
  "EnvEUS fosters community within the Environmental Engineering department at Northwestern.",
  "EPIC is Northwestern's interdisciplinary hub for entrepreneurship. From networking with alums and startup-building workshops, to our annual trip to Silicon Valley, to our accelerator, EPIC is the great starting place for entrepreneurship at Northwestern.",
  "Epic Movement is a Cru ministry, focused on reaching Asian American students and faculty through building Christ-centered movements that are culturally meaningful and significant.",
  "We are Northwestern University's Equestrian Team! We train under Coach Meggie Cramer at Red Coat Farm Riding Academy in Hawthorn Woods, IL.  We show on the IHSA circuit, and riders of all skill levels, including beginners, are welcome to join!",
  "A club for competitive and casual video gaming in the Northwestern community. Competitive includes, but is not limited to, League of Legends, Super Smash Bros., Overwatch, and CS:GO. Casual encompasses everything else people are interested in. ",
  "Ethics Bowl strives to spark interest in and awareness of societal issues involving ethics on campus. ",
  "The Northwestern Ethnic Studies Graduate Student Colloquium (NU ESG) provides an intellectual and social home for graduate students doing work in the field of ethnic studies. ",
  "Alpha Chapter, Northwestern University 721 University Place\r\nInstalled 1930\r\nChapter President: Matt Sachaj\r\nYou may visit the Alpha Chapter's website at http://northwestern.evansscholars.org/site/c.6pLHLUPxEdLUH/b.6141199/k.BF97/Home.htm.",
  "This is an example of the functionality of Wildcat Connection. Example Organization does not exist, except to share the possibilities Wildcat Connection can provide. ",
  "Extreme Measures is a co-ed a cappella group founded in 2007. In addition to producing its own shows and performing around campus and Chicago, EM has recorded three full studio albums, all available on iTunes and Spotify!",
  "\r\nEye to Eye is an organization that connects college students with LDs and ADHD with middle schoolers who have been similarly labeled. Eye to Eye uses an art-based curriculum to empower these students. ",
  "Northwestern's Club Fencing Team is an intercollegiately competitive team open to both experienced and beginning fencers. We have a top notch coaching  staff and equipment will be provided to those who need it. Practice is held in Patten.",
  "Welcome to Fiedler Hillel at Northwestern University, the foundation for Jewish life on campus, where Jewish life on campus is vibrant, engaging and exciting. Hillel encompasses a vast number of student groups and initiatives. ",
  "For Members Only (FMO) serves as Northwestern University's premier Black Student Union. FMO serves to encourage political, social, cultural and intellectual unity and growth first and foremost within Northwestern University's Black community.",
  "For Us, By Us (F.U.B.U.) is an ongoing space for courageous conversations about, by, and for Black women-identifying and non-binary folk.",
  "F&F Marketing is Northwestern University's premier student-run marketing agency, providing all of the services and resources of a modern marketing agency to student organizations and businesses at Northwestern University and in the Evanston/Chicago area.",
  "Foster-Walker (also called Plex) houses about 575 students in single-occupancy rooms, which are arranged in clusters of 4 or 5 rooms to each restroom. This building houses a 24-hour neighborhood desk, 2 dining halls, and a convenience store. ",
  "Northwestern's premier all-bowling a cappella group that isn't all freshman and has more than 15 people.",
  "A musical annually produced entirely by the freshman class.",
  "Founded in 2003, Fusion Dance Company is a collegiate dance company composed of around 40 dancers, who come from a vast variety of backgrounds and experiences. We dance for the love it spreads, and we are so excited to share that with you.",
  "'gami is Northwestern's first origami club, focused on positively impacting the NU and surrounding communities through origami. It aims to create an environment of reflection and relaxation on campus by coordinating various projects and events.",
  "The Beta Tau chapter of Gamma Sigma Alpha (founded in 1995) National  Academic Greek Honor Society (GSA) is the premier organization committed  to the academic success of our members and alignment with the academic  missions of our host institutions. ",
  "GSRC is located on the third floor of Norris University Center.",
  "Get-A-Grip is a project-based program that challenges middle school students to design and construct a prosthetic arm using low-cost, readily-available materials.",
  "Girl Up is a campus chapter of the UN Foundation's Girl Up campaign which promotes the education, leadership, and well-being of girls in our community and in developing countries around the world. We meet weekly on Thursdays at 7pm in the Women's Center.",
  "Women are under-represented in STEM fields and thus need to be given the tools, experiences, and confidence to go into them. We aim to encourage young women to develop interest in STEM through exposure to these subjects in a positive environment.",
  "Global Brigades is a sustainable development and health organization that works to empower international communities to provide better quality of life through various programs.",
  "The Global Engagement Summit (GES) is a 60-person community of changemakers that values engaging with the world in meaningful ways. A core part of what we do is organize an annual social innovation conference for entrepreneurs from all over the world.",
  "Engineering Brigades at Northwestern University is a chapter of Global Brigades, the world's largest student-led global health and sustainable development organization. ",
  "Our mission is to bring God\\u2019s healing to all nations.\r\n\\u201cArise, shine, for your light has come, and the glory of the Lord rises upon you.\\u201d Isaiah 60:1",
  "n/a",
  "GlobeMed presents an opportunity for students to contextualize healthcare inequity in a low-stress, non-academic setting. Uniting students from varying domestic and international backgrounds, GlobeMed fosters a safe space for discussion on global health.",
  "The Graduate Christian Fellowship is a community of Christian graduate and professional students. We also provide spaces for skeptics to discuss religion and its connection to contemporary life. Our website is here: studentorgs.northwestern.edu/gcf",
  "To foster greater cross-cultural understanding by promoting interaction, providing information and ensuring inclusion for and by the graduate international community of Northwestern University.",
  "The mission of the Graduate Leadership and Advocacy Council (GLAC) is to advocate on behalf of TGS graduate students and graduate student organizations to the Graduate School (TGS) and Northwestern University.",
  "TBA",
  "The Northwestern Graduate Student Association represents and serves non-professional graduate students at Northwestern University in Evanston and Chicago, IL.",
  "Ever wonder how you can get involved in the Latino community at Northwestern?\r\nG-SALSA (Graduate Student Association for Latino and Spanish Activities) was founded with the purpose of providing an  environment where students can meet and interact ",
  "GWAN is an interdisciplinary organization dedicated to providing community building opportunities for women graduate and professional students at NU. ",
  "Graffiti Dancers is a not-for-profit, student-run organization, and the premier contemporary dance company at Northwestern University. After four decades, Graffiti continues to create unique choreographic work at NU.",
  "GreekBuild is a student organization that promotes a positive image for the Greek community by organizing and providing service opportunities throughout Evanston and Chicago for Northwestern Greek students. ",
  "GREEN House (Group Residence for Environmental Engagement at Northwestern) is an environmentally-themed residence hall at Northwestern University.",
  "We are Griffin's Tale, Northwestern University's only Children's Repertory Theatre Company!  We take stories and poems written by kids in the Evanston and Chicago areas and turn them into skits, sketches, songs, raps, dances, and more! ",
  "Ground Floor Theatre Company seeks to provide opportunities for all-inclusive theatre that prioritizes the rehearsal process and welcomes actors and directors of all backgrounds and skill levels",
  "Habitat for Humanity is an organization dedicated to providing decent housing to deserving, low-income families. Our group maintains a focus on volunteerism, fundraising and having fun doing it.",
  "Happiness Club is a student group at Northwestern University committed to increasing the happiness of members of the Northwestern community. How do we do this? Through fun and exciting activities!",
  "Harmony in Spirit (HiS) is a co-ed collegiate Christian a cappella group at Northwestern University.",
  "HELICON is Northwestern's premier literary and arts magazine. We publish the best in student art twice a year, with submissions ranging from poetry and prose to music and videos to comic books and visual art. Visit helicon.northwestern.edu for more info.",
  "We are an online newsmagazine that is tailored toward Northwestern women. We offer a platform where any student can pitch whatever they want and write about what they are interested in. We welcome everyone and there are no barriers to membership. ",
  "Hobart House is on south campus and houses 50 women in single-, double-, and triple-occupancy rooms, arranged in a traditional-style layout. This building is available to all female undergraduate students.",
  "Northwestern University Homecoming complements the academic experience through a variety of cultural, social, community service, and recreational events that celebrate Northwestern Wildcat Pride.",
  "The Hong Kong Student Association (HKSA) is a cultural organization focused on building a community around the shared love of our city.",
  "HPCC looks to provide a group of committed hospice patient care volunteers to the Evanston & greater Chicago community, all the while supporting our volunteers to make sure students feel comfortable and confident during their interactions with patients.",
  "One of five strategic ministries under InterVarsity Christian Fellowship, HOTR is intentionally placed at Northwestern to serve its Black students and  is  committed to connecting students to God by seeking Jesus, sharing Jesus, and loving people. ",
  "We provide one-on-one mentorship for Evanston Township High School students who do not have the necessary resources or support in the general college application process. We place emphasis on service, individuality, and bi-directional learning. \r\n",
  "The Illustrators & Animators Club aims to serve the Northwestern animation community by supporting and promoting student animators. This club is open to all. No prior art experience necessary!",
  "We are a Black Christian ministry designed to equip Black students to become spiritual leaders in all areas of their lives. Impact is a loving space for Black students to seek community, while exploring and/or deepening their relationship with God. ",
  "In Our Nature is a student-run, paperless magazine that aims to bring the environment to everyone, and to provide a platform for students of all majors to express care for nature. ",
  "The Inclusion NU fund supports campus endeavors that promote inclusion at Northwestern.",
  "IGSSA aims to serve and foster a sense of community among the the Indian (and larger South Asian) graduate and post-doc population at Northwestern University.",
  "We are a student-led chapter of Indivisible, a grassroots movement of thousands of groups with a mission to elect progressive leaders and rebuild American democracy.",
  "IDSA creates a social environment for students of all backgrounds, and promotes Indonesian culture at Northwestern University.",
  "n/a",
  "Established in 2005, ISBE is the premier and largest student business group at Northwestern. ISBE consists of 7 subsidiary groups and over 150 members. We offer a diverse array of educational and experiential business opportunities.",
  "The Institute of Industrial and Systems Engineers (IISE) strives to improve the IEMS student experience by fostering community, providing academic & career services, and serving as the department liaison between administration and students",
  "NUii's chief objective is to promote and spread awareness of religious pluralism by increasing constructive communication between religiously diverse peers within the Northwestern community.",
  "The Interfraternity Council (IFC) consists of 17 nationally-recognized fraternities at Northwestern. For the past 150 years, IFC fraternities have enriched the lives of young men at Northwestern through educational programs and activities.",
  "ISA promotes interaction among students from different cultural backgrounds, serves as a platform through which to engage with global and cultural issues, and hopes to be a \"home away from home\" for students both from the US and abroad.",
  "West Fairchild is on south campus and houses 106 students in single- and double- occupancy rooms, arranged in an open suite-style layout. Men and women live in suites. This building is available to all undergraduate students. ",
  "A biblically based organization hoping to present the message of Christ to the campus and world, is open to all students. Weekly large group meetings and small group Bible discussion and prayer groups are included in this ministry.",
  "Interested in a potential career in investment management?  So are we, join a group that will give you broad exposure to the investment management industry and its professionals.",
  "Northwestern University Investment Management Group (IMG) is a student run organization dedicated to those who have an interest in investment. \r\n\r\nPlease email NorthwesternIMG@gmail.com for further inquiries and to connect with the Executive Board.",
  "The Iranian Students Association at Northwestern University is a student group dedicated to promoting social, intellectual and cultural activities for Iranian students and scholars.",
  "The Iranian Students Association at Northwestern University is a student group dedicated to promoting social, intellectual and cultural activities for Iranian students and scholars as well as interested members at the Northwestern University.",
  "Open to all interested students, the Italian Association (ITA) aims to establish a foundation upon which to develop and manifest Italian language and culture within the Northwestern community.",
  "We are a nationwide movement of campus chapters advocating and educating on colleges and universities for vigorous and sustained American leadership in facilitating a negotiated, two-state resolution to the Israeli-Palestinian conflict.",
  "Northwestern Japan Club is an organization that fosters an open and friendly environment for the enjoyment of Japanese culture through a supportive network and in a community oriented environment. We are an active student group that holds numerous ",
  "JASA is an organization that creates and fosters a community for Japanese Americans on campus. JASA is also meant to educate those within and outside of the Japanese American community about Japanese culture and contemporary issues.",
  "The purpose of The Jazz Club is to allow everyone in the Northwestern community the chance to play and experience jazz, regardless of their background and knowledge.",
  "The Jewish Theatre Ensemble is one of NU's student theatre boards. We aim to operate at a level of artistic excellence and support creative endeavors that promote Jewish themes in the arts. We produce three shows a year with many ways to get involved! ",
  "Book Buddies is in partnership with Evanston Public Library to bring volunteers to preschools in Evanston to promote literacy.",
  "Northwestern K-Dance is a student-led K-Pop dance group open to all levels of experience.\\u00a0",
  "TBA",
  "Kaibigan is a Northwestern student-run organization dedicated to promoting Philippine and Philippine-American culture through education and exposure. The group fosters a sense of community providing a reliable and supportive environment for its members.",
  "Theta Chapter, Northwestern University\r\n\"Achievement in every field of human endeavor.\"\r\nPresident: Adam Jackson\r\nYou may visit the Theta Chapter's website at  www.terriblethetanupes.blogspot.com.\r\n\r\nNational founding date: January 5, 1911",
  "Tau Chapter, Northwestern University. Address: 619 University Place\r\nIntalled September 29, 1887\r\nChapter President: Katherine Cirulli \r\nYou may visit the Tau Chapter's website at  \r\nhttp://nu-theta.weebly.com/",
  "Lambda Chapter, Northwestern University 711 University Place\r\nInstalled 1897\r\n\"Let us strive for that which is honorable, beautiful, and highest.\"\r\nChapter President: Emma Hartley\r\n",
  "Northwestern Colony of Kappa Delta Chi Sorority, Inc.",
  "Upsilon Chapter, Northwestern University 1871 Orrington Ave.\r\nInstalled 1882\r\nChapter President: Hannah Hudson\r\nOrganization Facts\r\nNational Founding Date: October 13, 1870\r\nColors: Dark blue, light blue\r\n",
  "Kappa Phi Lambda is Northwestern University's first Asian-interest, not Asian-exclusive, sorority. Founded in 2002, we proudly stand by our three pillars - sisterhood, service, and cultural diversity.",
  "Association of students enrolled in the MSMS program through Kellogg School of Management",
  "Kemper Hall is on north campus and houses 165 students in single- and double-occupancy rooms, arranged in a closed suite-style layout. Select suites have kitchens and can house both men and women in the same suite; suites without kitchens are clustered ",
  "TBA",
  "A graduate student a cappella group",
  "Knitwestern is a learn-to-knit club for Northwestern students and community members. Our mission is to teach knitting and then use those talents to knit warm winter items for Inspiration Corporation and the Broadway Youth Center of Howard Brown Health. ",
  "The Korean American Students Association (KASA) is an organization formed to provide social and culturally informative activities to all those who share a common interest in the Korean culture and Korean American issues. ",
  "Korean Student Association (KSA) consists of Korean graduate students, post-docs, and visiting scholars. KSA supports its members through welcome events, campus recruitment from Korean companies, and joint-socials with other universities in Chicago.",
  "Koreans Association At Northwestern University supports  Korean international students through new student welcome dinners, socials, various career workshops, alumni communications, IM sports teams and connections with other Midwest universities. ",
  "Koreans In Business (KIB) is an organization established to promote opportunities to learn about the Korean business environment and its culture to Northwestern University\\u2019s student body. ",
  "The Beta Omicron Chapter of La Unidad Latina, Lambda Upsilon Lambda Fraternity, Inc. at Northwestern University was established on April 5, 2013 with the intent of engaging members around academics, culture, brotherhood, and service.",
  "An informal soccer club that plays on the lakefill",
  "Welcome to Lambda Chi Alpha, Alpha-Iota Zeta\r\n\r\n2339 Sheridan Rd. Evanston, IL 60201.",
  "Lambda Strategy is a strategy consulting organization run by Northwestern University undergraduates, founded in 2017.",
  "Beta Psi Chapter, Northwestern University\r\nEstablished March 4, 2001\r\n\"Latin by Tradition, not by Definition.\"\r\nPresident: Magdalena Flores ",
  "A student alliance hoping to promote Latin American culture and history on campus, as well as educate the NU community on the various issues that Latin American countries face today. ",
  "Capacity building through creating mutually beneficial relationships with NU Students and community partners (both ongoing and one-time volunteer opportunities). Leadership development opportunities through workshops, cohorts and online training.",
  "The Leadership Development and Consulting Club aims to foster a community of student leaders and guide the management strategies and culture of Northwestern student organizations in order to better the Northwestern community as a whole.\r\n",
  "TBA",
  "LEND seeks to empower Evanston entrepreneurs by providing non-profit microlending & business training services.",
  "Liberty in North Korea hopes to help change the narrative surrounding North Korea by educating our community, and helping fundraise so that we may be able to help the North Korean people achieve their freedom",
  "TBA",
  "Lion dance is a form of ancient Chinese dance performed during traditional and cultural festivals, where a pair of performers would mimic a lion's movements in a lion costume.",
  "A student theatre group dedicated to providing creative opportunities for women theatre artists and producing feminist works.",
  "tba",
  "Lovers & Madmen is a student theatre group at Northwestern University that produces a full season of classical and classically-inspired works each year.",
  "tba",
  "Lutheran Campus Ministry is a welcoming community experiencing, living, and sharing the love of God through scholarship, service, and faith.",
  "[make]new is a Christian fellowship where students of all backgrounds can experience close community and learn more about the Christian faith.",
  "Northwestern's first and premier Mariachi group! Celebrating the culture and tradition of Mariachi music at NU. All NU students are welcome to join!",
  "MarketWatch is a student-led group with a focus on researching various markets and financial instruments, in addition to conducting informational interviews with Northwestern alumni.",
  "We are an all-masculine-identifying organization dedicated to ending rape culture & restrictive masculinity on campus through self-work & peer-led discussions. MARS is a space to be vulnerable, genuine, build connections & learn to support others. ",
  "N/A",
  "N/A",
  "TBD",
  "TBD",
  "N/A",
  "The Student Advisory Board for MEM is a group of MEM students that represent the student body.  SAB hopes to foster community within MEM by hosting social events, increase relationships between MEM with other graduate programs. ",
  "www.dilloday.com\r\n\r\nMayfest produces Dillo Day, as well as a series of special events throughout spring quarter. We book A-list artists for the largest student-run music festival in the country - and it's all free to Northwestern students.",
  "The McCormick Graduate Leadership Council helps graduate students connect through networking, professional development and social events.",
  "McCormick advisory board for undergraduate students.",
  "Home to Sigma Alpha Iota (SAI), the music fraternity for women, 720 Emerson is located on south campus and houses 26 women in single and double rooms. Residents are close to Foster-Walker, Allison, and Willard for dining. ",
  "tba",
  "The Medill Undergraduate Student Advisory Council is a selection of freshmen, sophomore, junior and senior Medill students that represents the undergraduate community to members of Medill's administration on work with them collaboratively.",
  "Founded in 1974, Mee-Ow is Northwestern University's premiere short-form comedy group combining sketch, improv and rock n' roll.",
  "The Northwestern Club Basketball Team has been competing against regional junior college and club teams for over 20 years. We serve as an outlet for the competitive desires of talented NU students and as a platform for exceptionally gifted players ",
  "The NU Men's Lacrosse Club welcomes all undergrads/grad students to join. Membership includes players with a wide range of skill from beginner to former NCAA athletes. We aim to have fun during practices and compete in the Great Lakes Lacrosse League.",
  "The NU Men's Club Soccer team is comprised of student athletes looking to continue playing competitive soccer without the restrictions and demands of a Varsity program during their undergraduate and graduate experiences.",
  "We're NU's Club Hockey Team. We practice on Monday and Wednesday. We usually play 2 games a weekend, during fall and winter quarter; we travel to about half of our games. We're affiliated with the ACHA. Please visit http://northwesternhockey.org/",
  "Originally founded in the spring of 1972, the Northwestern University Men's Rugby club is a member of the NCR organization. Follow us on Facebook and Instagram for event information.",
  "Northwestern Men's Club Ultimate team. ",
  "NU Men's Volleyball is an opportunity for players who played competitive volleyball in high school at the club/varsity level to continue playing on a high-level team with multiple matches and tournaments each quarter. ",
  "TBA",
  "We are a menstrual equity activism group focused on alleviating period poverty & period stigma through education, service & policy reform in Evanston and the state of Illinois. ",
  "MENtal Health combats stigma around mental health to the male population of NU. MENtal Health responds to gender discrepancies in use of mental health resources at NU. We aim to combat negative perceptions of masculinity that can lead to health issues.",
  "Mental Health Mix and Mingle is a graduate student-based group that aims to connect the two graduate programs housed within The Family Institute (Counseling and Marriage & Family Therapy). ",
  "The organization provides opportunities for graduate students and postdocs, primarily in STEM (Science, Technology, engineering, and Math), to mentor high school students at local high schools. ",
  "Meor Northwestern is a campus-based organization dedicated to extending Jewish learning opportunities to the broadest spectrum of Jewish students at Northwestern University. Through timely classes, lively discussions, transformative trips and other ",
  "MiniChefz is an organization that looks to encourage healthy eating and nutrition among the youth of our city. ",
  "The purpose of MAPS is to serve the minority pre-health students of Northwestern  by providing valuable information that pre-health students need, prior to attending medical or graduate school, through meetings, workshops, events, etc.  ",
  "MIXED serves to create an inclusive community for people of all racial/ethnic backgrounds by hosting fun activities as well as generating discussions and bringing in speakers with an emphasis on the multiracial experience. ",
  "NUMT competes against the top programs across the nation in simulated trial tournaments where participants are scored for their advocacy skills as lawyers and performance as witnesses.",
  "Moneythink sends Northwestern students to visit various high schools in the Chicagoland area weekly. There, we educate dozens of under-resourced students in essential financial skills, preparing them for college life and beyond.",
  "Morning Mentors aims to develop the graduate community by providing an opportunity for community service and bringing together students of different departments with similar goals and interests by facilitating a tutoring program for a local school.",
  "Mortar Board is the premier national honor society for students of senior standing that recognizes superior achievement in scholarship, leadership, and service.",
  "The purpose of the Multicultural Filmmakers Collective is to nurture, promote, and ally multicultural student filmmakers at Northwestern University, as well as support student films that present multicultural concerns and experiences. ",
  "The MGC is a unique community of fraternities and sororities; each of these member organizations' foundations is founded upon celebrating cultural diversity and educating the community about its rich cultural heritage.",
  "Multicultural Student Affairs is committed to fostering an inclusive environment that promotes identity development, intercultural exchange, academic excellence, and leadership. While our departments primarily focus on traditionally under-served student ",
  "Our mission is to save the vaquita porpoise, which is the world's most endangered marine mammal. We accomplish our mission through public outreach and engineering projects. ",
  "The Muslim-cultural Students Association (McSA) is a community oriented organization that caters to the many different needs of Northwestern students. Our members are Muslim and non-Muslim alike. Even with such a diverse membership, our fundamental goals",
  "The NU Chapter of the National Association of Black Journalists is an organization of students seeking to provide quality programs and services to aspiring black journalists. The organization serves to strengthen the ties among black journalists.",
  "The National Pan-Hellenic Council, Inc. (NPHC) at Northwestern University consists of seven of the \"Divine Nine\" historically black fraternities and sororities.",
  "Northwestern University's chapter of the National Residence Hall Honorary",
  "The National Society of Black Engineers (NSBE)'s mission is to increase the number of culturally responsible black engineers who excel academically, succeed professionally, and positively impact the community.",
  "The NU NSSLHA Chapter is a pre-professional association for graduate and undergraduate students interested in the study of communication sciences and disorders (CSD).  ",
  "The Northwestern University Neuro Club is a student organization with the goal of furthering the education and understanding of neuroscience and related fields within and surrounding the Northwestern University community.",
  "New Life Volunteering Society (NLVS) provides health-related service and leadership opportunities for Northwestern students.  We have ties to health clinics in the Chicago area, the Feinberg School of Medicine, and Evanston-based organizations. ",
  "This organization facilitates connections between students who have experienced a loss. \r\nIn an effort to destigmatize and normalize grief, we provide a collective space for support, communication, and education.\r\n",
  "NMP's mission is to provide students with the resources and programming to support their artistic discoveries through dance by producing the yearly Fall Dance Concert, hosting guest artists for residencies and workshops, and supporting projects. ",
  "This group meets quarterly to deliberate on proposals for new registered student organizations to be recognized. ",
  "Nine Lives Podcast shares true, unaltered stories from the NU community with the student body. ",
  "Niteskool Productions is the premier music management and video production group. Through highly professional student-produced music video content, Niteskool aims to expose Northwestern talent to the greater student body. ",
  "Northwestern University department within Student Affairs serving as primary ticket printing and sales agent for registered Northwestern University student organizations and departments. Located on the first floor of Norris University Center.",
  "An office within the Cash Operations Area that offers deposit and starting fund services for student organizations.",
  "Norris Operations Staff student employee site.",
  "Home to an array of services, resources, and meeting spaces, Norris University Center is the center of campus life at Northwestern community.  ",
  "North by Northwestern is one of Northwestern University's best independent online publications, updated around the clock with stories about campus and culture. In Spring 2008, we launched a print magazine. Both online and off, we report the truth, ",
  "The governing body of Northwestern's 14 a cappella groups.",
  "Come enjoy Anime, Japan's unique style of animation, with NU Anime Club. Experience the wealth of genres and styles that Anime has to offer and talk about it with us!",
  "The Northwestern Art Review is an academic organization based at Northwestern University that seeks to promote art historical discourses at the undergraduate level. By publishing an annual journal of art scholarship and critique, the Northwestern Art ",
  "Founded in 2006, Northwestern Bhangra aims to promote awareness of Punjabi culture through dance. Since our founding, we have grown into a team that performs at events all around the Chicagoland area and at competitions across the nation.",
  "The mission of Northwestern Career Advancement (formerly UCS) is to foster excellence in career development, preparation, and professional opportunity for undergraduate and graduate students and alumni by providing comprehensive services. ",
  "We are a group of Chinese students, scholars and local families united by the Christian faith. We share the gospel and study Bible every Friday evening on Evanston campus. Our door is open to all.",
  "Northwestern Club Swimming was founded in 2008 providing a club swimming opportunity for undergraduate students at Northwestern. We practice three to four times a week at Norris Aquatics Center at SPAC and attend meets throughout the year.",
  "Northwestern Community Development Corps (NCDC) seeks to strength community through creating and maintaining mutually beneficial partnerships between and among Northwestern and its Evanston and Chicago neighbors.",
  "We are Northwestern's premier gospel choir founded in  performing spiritual, gospel, and anthem music from the black Christian tradition. ",
  "Northwestern Crew is a co-ed club sport that competes with other club and varsity programs throughout the county. We are an active team throughout the entire year with our main seasons in fall and spring and indoor training in winter. ",
  "We are a small group of Northwestern students who organize an annual economics tournament for high school students from the Chicago area and around the country.",
  "Interested in Emergency Medicine?\r\nWant to learn more about how to deal with medical emergencies? We offer an EMT-B course and other opportunities to learn and teach life-saving knowledge to the NU community!",
  "NETG aims to advance the research and development of sustainable energy technologies by providing educational and collaborative opportunities for Northwestern University students. Please visit netg.northwestern.edu to join our listserv.",
  "We encourage students to plan for anticipated expenses, prepare a budget, and consider the impact their financial decisions will have on their credit.",
  "The Northwestern Flipside is Northwestern University\\u2019s official satirical newspaper. We publish new content online daily, as well as monthly print issues distributed across campus. Visit our website at www.NorthwesternFlipside.com for more information!",
  "McCormick Student Group",
  "Northwestern Geoclub is a coalition of students passionate about the outdoors, science, and inclusion. We strive to make our club accessible members both inside and outside the field of geology, creating a diverse and like-minded community!",
  "The Hawaii Club shares Hawaiian culture with the Midwest through events like our annual luau. We also encourage the \"Aloha Spirit\" across campus and are ambassadors to Hawaii students during their college careers.",
  "Are you interested in learning a traditional Japanese martial art? Strengthening your body as well as your mind? Having fun, making friends, and learning something new? Then check out Northwestern Karate Club!",
  "Learn more about us at www.nu-nafme.org",
  "NNN is the only broadcast news station on campus. We produce, shoot and report for three weekly newscasts specializing in campus news, sports and politics, in addition to our online platforms. ",
  "We are the sports department of Northwestern's student television station. Our group produces our own sports television show which we shoot once a week. Our staff member shoot, edit, and anchor all of our content, and we often travel to road games.",
  "NuTango is a Northwestern University student-run organization for Argentine Tango. We host lessons, practices, and dance events. ",
  "The Northwestern University Political Union is a community of students united by their common interest in discussion of political and global affairs.\r\n\r\nVisit http://www.nupoliticalunion.com/ for more information.",
  "NPHR is a student-run academic journal. Our goal is to take you behind the scenes of public health and provide a simpler platform for students and faculty to share their public health perspectives, ideas, and original research.",
  "NUQSN aims to create an engaged and supportive community for low-income and first-generation students as well as their allies in addition to ensuring equal opportunities for all low-income and first-generation students on Northwestern's campus.",
  "Northwestern Raas is the University's premier co-ed Raas and Garba team, a high-energy folk dance originating from the Indian state of Gujarat.",
  "NSTV (Northwestern Sketch Television) is a College Emmy-award winning sketch comedy group from Northwestern University. Including over eighty students working in various positions, we write, direct, shoot, promote, and act in a wide variety of sketches.",
  "Each year, our organization plans a trip out west for 800-1000 Northwestern students to ski and snowboard after fall quarter finals week.",
  "Lindy Hop, East Coast, Charleston, and Balboa are what we do. We focus and promote social dancing with (new) friends by providing weekly dancing classes, quarterly dances with live band, and occasionally dance workshops. ",
  "As the premier martial arts club on campus, we're dedicated to providing a friendly motivating environment for members of all abilities. We compete in tournaments and perform in shows year-round. Come learn the world's most popular martial art with us!",
  "NU Triathlon competes at the highest level of collegiate triathlon and welcomes students of all abilities and backgrounds to join us. Already an elite triathlete? Ran or swam in high school? Don't know what a triathlon is? There's a place for you here!",
  "NUEC seeks to develop a community of NU undergrads who are passionate about the energy industry through educational, professional and discussion-based activities. ",
  "Northwestern Undergraduate Law Journal (NULJ) provides a platform for the submission and discussion of law-related topics for students at Northwestern University. Our mission is to encourage legal and political awareness in the Northwestern community. ",
  "The Northwestern Undergraduate Research Journal (NURJ) is an annual student-produced journal that showcases outstanding research done by Northwestern undergraduates from across all academic fields.",
  "The Northwestern University chapter of the American Society of Mechanical Engineers",
  "CaSA gathers Catholic students and their friends to grow in friendship with each other and Christ. We invite students to explore faith, serve others, and enjoy each others' company. Our home is the Sheil Catholic Center.",
  "Welcome to the NU Community for Human Rights! Our aim is to spark dialogue, foster activism, and improve awareness surrounding global and local human rights challenges. ",
  "NUDM is a year-long effort culminating in a 30-hour dance marathon that unites the Northwestern, Evanston, and Greater Chicagoland communities through awareness, service, education, and philanthropic fundraising.",
  "Effective altruism is a philosophical and social movement that uses evidence and reasoning to determine the most effective ways to do good. ",
  "Fossil Free Northwestern is a group of students, faculty, staff, alumni, and community members calling on Northwestern University to remove its investments in coal and move toward divestment from all fossil fuels. We aim to build a sustainable endowment ",
  "Our mission is to offer a premier Model UN conference for High School students from around the world, while fielding a top flight competitive travel team that can compete on the national American circuit.",
  "The Northwestern University Nanotechnology Club (nanoNU) is an interdisciplinary student organization focused on the current and potential applications of nanotechnology in society.",
  "Northwestern University Native American and Indigenous Student Association is dedicated to promoting and inspiring the interests of the community of Native American students and those who appreciate Native American cultures at Northwestern University.",
  "Providing your outdoors fix since 1965.",
  "Northwestern Undergraduate Philosophy Society (NUPS) is designed much like the Academy of Athens, where students come together to agree, contemplate, consider, and debate with each other.",
  "SACNAS is a society of scientists dedicated to fostering the success of Hispanic/Chicano and Native American scientists\\u2014from college students to professionals\\u2014to attain advanced degrees, careers, and positions of leadership in science.",
  "We are a student-run, student-led club sport team at Northwestern, practicing on Lake Michigan out of the NU Sailing Center and competing in regattas on both a local and national scale.",
  "We are Northwestern's aerospace interest group dedicated to participating in NASA competitions, rocketry challenges, and approved student proposed projects. We also reach out to local schools to get the next generation excited about space exploration.",
  "Northwestern University Special Olympics is the oldest and largest collegiate Special Olympics chapter. Our mission is to integrate individuals with developmental disabilities into our community through inclusive programming.",
  "The NUTTC is a student-ran group group focusing on the development of skill and interest in table tennis on campus. The club has both a competitive and recreational team to suit the preferences of students' interest. ",
  "Mission: NUVA provides Veterans access to the resources, support and advocacy they have earned, deserve and require to succeed in higher education, to achieve their academic goals, and to gain meaningful employment following graduation.",
  "Supporting the advancement of women in film",
  "Wildside is the Official Student Section of Northwestern Athletics. All students at Northwestern are members of Wildside. Wildside also allows for greater involvement for students through committee and executive leadership positions.",
  "Women's Club Basketball is everything you dreamed it would be and more. We road trip around the midwest playing basketball in the varsity team's old uniforms. We are often mistaken for D1 athletes when we eat at Chipotle after our games. Come tryout!",
  "Nous F\\u00e9's purpose is to provide all interested students at Northwestern with the opportunity to engage in meaningful and sustainable global health work through medical service and non-profit work with Angel Wings International. ",
  "The NROTC Program was established to educate and train qualified young men and women for service as commissioned officers in the Navy and Marine Corps.",
  "NSSLHA-Undergraduate creates an open, inclusive, and equitable space for undergraduates interested in the study of Human Communication Sciences and Disorders to come together in pursuit of academic, social, and professional opportunities in this field.",
  "NU Asian Magazine is Northwestern University's Asian American-interest magazine. We publish at least twice a year and cover anything and everything related to the greater Asian American community.",
  "N/A",
  "A community-building graduate club dedicated to teaching and playing the great winter sport of curling. Our FREE events take place at the Chicago Curling Club, located a short carpool ride away in Northbrook. From fall to spring we host weekly lessons.",
  "The long-term objective of the organization is to develop a stronger sense of community between graduate and undergraduate students at Northwestern University through mentorship.",
  "The volunteers involved with NU Heights have the opportunity to tutor and mentor elementary and middle school-aged students in various local schools. Tutors work either in classrooms throughout the school day or during after-school activities. ",
  "NU Nights is a student-led organization with the aim of bringing substance-free, late night programming activities to Northwestern undergraduate students and uniting our campus community through these activities.",
  "We welcome people from the fields of engineering, materials science, chemistry, and others. We promote the science of light at Northwestern, as well as foment social and professional interaction of our student members and faculty.",
  "NU Robotics Club is an open interdisciplinary group working on robotics competitions and design projects in teams of undergraduate students. We are always looking for new project ideas, feel free to reach out. All skill levels are welcome!",
  "NU's official student chapter of the Society for Industrial and Applied Mathematics. We organize events to promote interaction between students involved in different areas of science. \r\n",
  "We are an undergraduate student team at Northwestern that builds solar powered electric vehicles, which we race in a number of national competitions against other university teams. We are also active in the chicago community.",
  "Syllabus, founded in 1885, is the official undergraduate yearbook of Northwestern University. Published by Students Publishing Company, Inc. Syllabus features the memorable events that make up the collective Northwestern experience.",
  "We are a student-run thrift store currently organizing pop-ups at the end of every quarter. Our mission is to bring affordable and sustainable casual clothing to Northwestern students, while also providing funding to student activist groups.",
  "NUIdeas is a multi-level grant competition that fund's students ideas for change at NU. Applicants are coached by professionals as they advance through the 3-step process to improve on their presentations. Winners can receive up to $10k.",
  "The Office of Fraternity & Sorority Life provides support for the vibrant community of affiliated students at Northwestern University.",
  "Hear from students, staff, and faculty about their first-generation and/or low-income experience at Northwestern.\r\nhttp://www.northwestern.edu/enrichment/about-us/we-are-here-video/index.html",
  "Religious/Spiritual Hindu student organization on Northwestern University Evanston campus",
  "The Alpha Alpha Chapter of Omega Delta Phi was installed at Northwestern University on November 25th, 1997. The brothers of Omega Delta Phi make it their organization's goals to graduate its members and to serve its surrounding communities.",
  "Nate Silver\\u2019s improbably entertaining book on statistics and forecasting, The Signal and the Noise: Why So Many Predictions Fail \\u2014 but Some Don\\u2019t, is Northwestern University\\u2019s One Book One Northwestern all-campus read for the 2016-17 academic year.",
  "Opera Project for University Singers (OPUS) is an ensemble of undergraduate singers and actors at Northwestern University who seek to direct, produce, and perform student-driven opera.",
  "The purpose of the  Delta Nu chapter of Order of Omega is to recognize those fraternity men  and women who have attained a high standard of leadership in  interfraternity activities, to encourage them to continue along this  line, and to inspire others ",
  "From what started as a revue of the African American Theater Ensemble in the 1970s, ODB has emerged with sold-out sketch and improv shows that provide a spotlight for students of color and marginalized identities to practice comedy on their own terms. ",
  "The goal of this oSTEM chapter is to empower LGBTQIA+ people in STEM to succeed personally, academically, and professionally by cultivating environments and communities that nurture innovation, leadership, and advocacy.",
  "The Northwestern Panhellenic Association (PHA) consists of 12 nationally-recognized chapters. Each chapter has a sorority house on the south end of Northwestern's campus, and all of the organizations have a long-standing history at NU.",
  "Panoramic Photography serve photographers on campus through providing workshops on photography skills, group photoshoots in Chicago, and an online magazine where photographers can showcase their work.",
  "Paracombatives JuJutsu teaches students self-defense in a practical setting. We provide students the skills necessary to protect themselves against violence in an urban environment. Our club welcomes students of all experience levels.",
  "Parliamentary debate is a form of extemporaneous debate in which two teams of two people go against each other. You can debate about almost anything and no prior experience is needed!\r\n",
  "Peer Health Exchange\\u2019s mission is to empower young people with the knowledge, skills, and resources to make healthy decisions. ",
  "Peer Inclusion Educators (PIE) is a student organization dedicated to fostering an inclusive learning environment for issues surrounding personal awareness and social justice to peers through facilitation of specific and intentional programming to campus",
  "Phi Alpha Delta is an international coed professional fraternity, and it remains the only Law Fraternity with a national Pre-Law Program committed to meeting the needs of undergraduate students interested in the law.",
  "Co-ed International Medical Fraternity that provides, mentoring, networking, leadership development, scientific education, volunteering opportunities, and a support community on the NU campus. ",
  "Illinois Alpha Chapter, Northwestern University 2347 Sheridan Rd.\r\nInstalled February 12, 1859\r\n\"One man is no man.\"\r\nChapter President: Michael Hong\r\nOrganization Facts\r\nNational Founding Date: December 26, 1848\r\nColors: Azure, argent\r\nYou may visit ",
  "Phi Chapter, Northwestern University 2331 Sheridan Rd.\r\n\"Friendship, the sweetest influence.\"\r\nChapter President: Justin Erb\r\nOrganization Facts\r\nNational Founding Date: May 1, 1848\r\nColors: Royal purple\r\nYou may visit the national website at ",
  "This is a professional development organization for Northwestern Undergraduate students of all majors.",
  "Illinois Alpha Chapter, Installed 1864\r\nNational Founding: February 19th, 1852\r\n\"United by friendship, sustained by honor, and led by truth, We live and flourish.\"\r\nBrotherhood: 127\r\nPresident: Stephen Ross\r\nAddress: 2247 Sheridan Rd.",
  "The object of this fraternity shall be for the development of the best and truest fraternal spirit, the mutual welfare and brotherhood of musical students, the advancement of music in America, and a loyalty to the Alma Mater",
  "Phi Sigma Pi is a gender inclusive National Honor Fraternity. It is a unique organization combining the best attributes of an honor society, service group and social fraternity. Phi Sigma Pi provides a supportive community and memorable experiences.",
  "Philanthropy Choir is a student-run community service show choir dedicated to bringing quality musical performances to locations such as retirement homes, women\\u2019s shelters, and hospitals.",
  "The Physicians for Human Rights Student Program is a chapter of a national student program committed to advocacy for health and human rights violations on undergraduate and medical school campuses.",
  "Illinois Epsilon Chapter, Northwestern University 636 Emerson Street\r\nInstalled 1894\r\n\r\nYou may visit the  Chapter's website at  \r\nhttp://www.pibetaphi.org/pibetaphi/northwestern/.\r\n",
  "Gamma Rho Chapter, Northwestern University 2317 Sheridan Rd.\r\n\"Once a Pike, Always a Pike.\"\r\nChapter President: Nick Crance\r\nYou may visit the Gamma Rho Chapter's website at  www.nupike.com.\r\nOrganization Facts\r\nNational Founding Date: March 1, 1868",
  "Pioneers of Interactive Entertainment (PIE) is Northwestern University's chapter of the International Game Developers Association.",
  "Planned Parenthood Generation Action at NU will work with local Planned Parenthood staff to learn about and engage in youth organizing, leadership development, voter engagement, and other activities to promote reproductive rights and freedom for all. ",
  "We are a community garden located on the patio of the Technological Institute on the Evanston campus.  The garden is a place where graduate students, staff, and others can interact and relax outside of their labs and offices.",
  "We are the Northwestern Chapter of the Platypus Affiliated Society. Platypus organizes reading groups, public fora, research and journalism on the history and present tasks of the Left and Marxism.",
  "The Polish American Student Alliance (PASA) seeks to connect the Northwestern community with Chicagoland's rich Polish traditions. PASA commits itself to building a strong community among its members and working with other cultural student groups.",
  "The pre-dental society is a group dedicated to pre-dental preparation, education and service in the field of oral healthcare.  We strive to provide resources and a community for students pursuing pre-dental studies.",
  "The purpose of the Pre-Med Peer Mentoring Program is to match pre-med underclassmen with successful pre-med upperclassmen to provide their personal insight on how to succeed as a pre-med student.",
  "The Pre-Veterinary Society at Northwestern University is a group dedicated to students who are pursing a pre-veterinary agenda on their path to veterinary school. ",
  "Project RISHI (Rural India Social and Health Improvement) is a national non-profit organization dedicated to advancing public health and addressing social issues in rural India. We are partnered with a site in Northern India named Charnia.  ",
  "Project SOAR pairs Northwestern students with at-risk Evanston youth for one-on-one mentoring.",
  "Delivering the healing power of play to pediatric patients!",
  "Recognizing and promoting excellence in the science and application of psychology.",
  "The Public Affairs Residential College (PARC) is a south campus living community at Northwestern University focused on integrating public affairs concepts into the living environment. The building houses 70 students in single and double-occupancy rooms.",
  "Our mission is to empower NU Students to become eloquent speakers and confident leaders through continuous opportunities to develop their communications and leadership skills in an inclusive community.",
  "Pura Playa is Northwestern University's plastic waste reduction team. We are an Engineers for a Sustainable World (ESW) project that aims to address plastic use in our community and its effect on the environment.",
  "Purple Crayon Players is a student-run theatre company on the Northwestern University campus committed to creating high quality productions, events, and educational materials regarding all aspects of theatre for young audiences.",
  "In the vibrant Northwestern a cappella community, Purple Haze prides itself on maintaining the highest standards of musicality while keeping the fun and love alive!",
  "The Queer Pride Graduate Student Association (QPGSA) is an award-winning social, advocacy, and academic group for the LGBTQ+ graduate student community at Northwestern University.",
  "Northwestern Quizbowl participates in academic buzzer competitions against other colleges. ",
  "Radius Theatre is dedicated to creating theatrical opportunities for and amplifying the voices of students of color, or any students that feel they are misrepresented at Northwestern or in the entertainment industry as a whole. ",
  "Our purpose is to create a safe space at Northwestern University that encourages personal development for Northwestern\\u2019s 2SLGBTQ+ community and coalition building among our intersecting communities.",
  "The Responsible AI Student Organization (RAISO) is an open community for students from all majors to learn about artificial intelligence and discuss its impacts on our society. ",
  "Real Food at NU, the Northwestern University student chapter of The Real Food Challenge, aims to build a just and sustainable food system at NU.",
  "Northwestern University chapter of the American Red Cross.",
  "Reformed University Fellowship (RUF) is a Christian community at Northwestern seeking to reach out to people from diverse backgrounds with the message of the gospel and to help one another live our lives in response to who Jesus is and what he has done ",
  "Refresh Dance Crew was born in 2005 from a group of friends who wanted to learn how to dance. Since then, Refresh has grown into a large family of dancers with different styles that range from popping and breaking to choreography.",
  "Relay for Life is the largest nationwide fundraiser for the American Cancer Society, raising over $400 million for cancer research and advocacy. We regularly raise over $100,000 and host an annual event with hundreds of participants.",
  "The primary mission of the Office of Religious & Spiritual Life is to promote spiritual growth and nurture at Northwestern University.  Spiritual maturity entails      * reflection on the meaning and purpose of human existence ",
  "The Renaissance Singers is a student-led vocal ensemble that performs diverse repertoire from the Renaissance and Baroque eras, focused on the promotion of early music and, occasionally, commissions from student composers.  ",
  "RCB is comprised of the 10 Residential Colleges at Northwestern. Our motto, a tradition of living and learning, exemplifies our goal: to bring an enhanced sense of community to your dorm life and to help students learn outside the classroom.",
  "The Residential College of Cultural & Community Studies (CCS) is one big family of diverse and dedicated students. Its intimate setting and small population easily allow it be one of Northwestern's best kept secrets.",
  "University Residential Life (URL) is a Student Affairs department. Our vision is \"Engage and educate: Creating communities of learners, leaders, and responsible citizens. \"Through our mission we strive to promote a sense of community and encourage the ",
  "Residential Services at Northwestern is committed to providing an environment that fosters the academic and personal success of every student.",
  "Rince Cait is a Northwestern student group comprised of dancers of all skill/ability levels dedicated to bringing Irish Dancing and culture to the Northwestern community. ",
  "A collection of rollerbladers and people who ride ripsticks aiming to bring students together to create a community of adventure and freedom ",
  "Rogers House & 1856 Orrington are two separate communities located within the sorority quad on the south side of campus. These two communities share a programming board, and together house just under 60 residents.",
  "Our purpose is to give Russian students of all levels an outlet outside of class to learn more about Russian language and culture. We want to host fun events that improve students speaking and their knowledge of Soviet and modern Russian food and culture",
  "On-campus living facility.",
  "NU for SACH supports an Israeli-based organization called Save a Child\\u2019s Heart (SACH) that provides life-saving cardiac surgeries for children from developing countries who cannot afford these treatments. ",
  "Scene+Heard is Northwestern's official online arts and culture publication. Through dynamic content, exclusive interviews, and first-hand coverage of the best events on-campus and Chicago, we're transforming the way students interact with culture.",
  "A volunteer-based organization committed to hosting a Science Olympiad invitational for Division C teams in Illinois and surrounding states and coordinating volunteers for Illinois Regional and State tournaments. ",
  "Advocating for science and evidenced-based decision making to policymakers and the voting public.",
  "Seabury Hall is between north and south campus (right across from Technological Institute) and houses 24 students in single-occupancy rooms, arranged in a closed suite-style layout. Men and women live in suites clustered by gender. This building is ",
  "Seesaw Theatre strives to enrich the lives of autistic and otherwise disabled individuals by increasing their access to theatre and fostering the use of performance as a channel for expression.",
  "\r\nSegal Professional Bridge is an organization aimed at connecting students, faculty members and industry professionals who are passionate about design, innovation and entrepreneurship.\r\n\r\n",
  "Senior Year Committee",
  "SHAPE is a Northwestern student organization affiliated with CARE that combats rape culture and works to create a culture of healthy sexuality through education, public events, and open dialogue on sexual health, sex positivity, and sexual assault.",
  "We are members of the Northwestern University community contributing to the creation of a culture of peace and nonviolence based on the teachings of the Nichiren school of Mahayana Buddhism as practiced in the Soka Gakkai International-USA (SGI-USA). ",
  "Spreading Healthcare Awareness through Reciprocal Education",
  "Shepard is a multithematic residential college that houses 74 students, mainly sophomores and freshmen. It is located on south campus, at the center of the sorority quad. Its residents refer to themselves as \"sheep.\"",
  "SMA provides an educational forum for the intellectual development of Shia Muslims student community on campus. We seek to spread the knowledge of the Sublime Quran, the Prophet Muhammad, and the Twelve Imams through lectures and symposia.",
  "ShireiNU A Cappella is Northwestern's premier Jewish a Capella group, founded in 2009. With both Jewish and non-Jewish members, we sing English and some Hebrew music all over campus and throughout Chicagoland!",
  "Special Interest Group in Chinese Theater (SIG Theater) is a TGS-sponsored theater club at Northwestern. Our goal is to broaden student life by hosting theater-related events.",
  "Illinois Psi-Omega Chapter, Northwestern University 2325 Sheridan Rd.\r\nInstalled 1894\r\nChapter President: Austin Gundry\r\nYou may visit the Illinois Psi-Omega Chapter's website at  www.saeilpo.com\r\nNational Founding Date: March 9, 1856",
  "Sigma Alpha Iota is an international music fraternity for women, open to female students of all majors as an opportunity to continue their musical involvement after high school. Visit our website at http://sainorthwestern.wixsite.com/saibeta ",
  "Omega Chapter, Northwestern University 2249 Sheridan Rd.\r\nInstalled June 23, 1869\r\n\"In this sign you will conquer.\"\r\nChapter President: Joe Sauer\r\nYou may visit the Omega Chapter's website at  http://northwesternsigmachi.com.",
  "The Eta Chapter of Sigma Gamma Rho Sorority, Inc.",
  "Tau Alpha Chapter, Northwestern University\r\nInstalled February 19, 2000\r\n\"Culture is Pride, Pride is Success.\"\r\nPresident:  Gabriella Rios\r\nYou may visit the Tau Alpha Chapter's website at www.tagammas.org\r\n\r\n",
  "Gamma Beta Chapter was founded in 1898 with a rich history and tradition at Northwestern and is committed to its principles of Love, Honor and Truth, and has stood in firm opposition to hazing since its founding in 1869 at the Virginia Military Institute",
  "Illinois Lambda Chapter, Northwestern University \r\n2341 Sheridan Rd.\r\n\"Building Balanced Men\"\r\n",
  "Sigma Psi Zeta is the newest Asian-interest sorority on Northwestern's campus. We are dedicated to providing an invaluable experience for our sisters and enriching our university and its surrounding community through service and innovative programming.",
  "Significant Others is Northwestern's premier a cappella group for treble voices, founded in 1994. We are a close community of female and non-binary folx who love to sing together! We are also avid Just Dance fans.",
  "TBA",
  "Singapore Society (SingSoc) is a cultural organization that celebrates the uniqueness of Singapore. SingSoc organizes many events and get-togethers for anyone interested in Singapore's rich culture and history. ",
  "Sit & Spin Productions is a theatre board at Northwestern University that produces unconventional, risk-taking, and site-specific work.",
  "The Slivka Residential College of Science and Engineering provides a unique living and learning opportunity for undergraduates interested in science, engineering, and technology. Slivka houses 140 students in single and double rooms.",
  "Smoke and Mirrors: NU Magic is established for the purpose of gathering magicians on campus and to spread the joy of magic to students at Northwestern.",
  "Social Justice Education (SJE) creates co-curricular educational opportunities in partnership with our student community that foster self-exploration, facilitate conversations across difference and support actions that create social change on campus. ",
  "SASE prepares Asian heritage scientists, engineers & technologists for success in the global business world, celebrates diversity & provides opportunities for students to contribute to their local communities.",
  "Our mission is to promote the development of Hispanics in engineering, science, and other technical professions to achieve educational excellence, economic opportunity and social equity.\r\n",
  "SPS is a community for anyone interested in physics, astronomy, space science, engineering ... Whether you're seeking pre-professional experience or a community of like-minded enthusiasts, the Society of Physics Students welcomes you!",
  "The Northwestern/Medill chapter of the Society of Professional Journalists promotes student journalism and provides resources for the Medill community to connect with professionals in the industry and learn important tools to improve as journalists.",
  "SWE\\u2019s mission is to create a supportive community of women and non-binary engineers through professional and social programming. We aim to empower our members to fulfill their full potential as engineers and leaders and inspire the next generation.",
  "The Software and Game Development Group (SGDG) provides opportunities for current and aspiring developers, designers, artists, and more in creating apps and video games.",
  "Soul4Real is Northwestern's premiere Black a cappella student group. Founded in 2009, S4R serves to expose the Northwestern community to the fullest spectrum of historically Black musical genres including R&B, Soul, Hip-Hop and more. ",
  "South Asia Initiative is an organization focusing on the discussion of South Asian political, economic and social issues from the perspective of different South Asian countries.",
  "The South Asian Students Alliance (SASA) is the largest cultural student organization on campus that is dedicated to the celebration of South Asian culture. ",
  "Spectrum Theatre Company is dedicated to empowering the greater Northwestern community by raising awareness, inspiring dialogue, and affecting change through theatrical experiences based on relevant social and political issues.",
  "The Speech Team offers students a venue to participate in collegiate public speaking competitions. We also host showcases and tournaments on campus, such as the Tournament of Champions in Extemporaneous Speaking. ",
  "Graduate Student Improv Troupe",
  "The official spirit squad of the Northwestern University Department of Athletics and Recreation.  ",
  "Northwestern Splash is an outreach organization that allows Chicagoland high school students to take classes taught by members of the NU community.",
  "Spoon is the food resource for the millenial generation.",
  "The Sportsman's Club is an organization that aims to connect Northwestern students who share a passion for angling, hunting and sporting activities.",
  "The Sports Analytics Group is a group of Northwestern undergraduates committed to strategic data analysis and outside the box thinking in all facets of sports (business, roster management, fantasy, in-game strategy, etc.).",
  "The School of Professional Studies offers a part-time Master of Arts in Sports Administration (MSA) program that focuses on the business of athletics. The MSA Student Board adds opportunities to meet and socialize with industry professionals.",
  " .",
  "We are committed to providing an enjoyable and competitiion-driven experience for our members. We love the sport and enjoy getting better at playing and being better teammates.",
  "St. Baldricks fundraises in support of childhood cancer research, primarily by organizing a year-end head-shaving event to stand in solidarity with child patients.",
  "Steam Heat is Northwestern's premier musical theatre dance company dedicated to preserving original musical theatre choreography and inspiring new theatre dance. We perform dance styles including jazz, tap, contemporary, hip-hop/urban and more! ",
  "STITCH is a fashion publication at Northwestern University. Our blog, www.stitchfashion.com, is updated daily, and our latest print issue can be found at https://issuu.com/stitchfashion/docs.",
  "The Student Academy of Audiology is the national student organization of the American Academy of Audiology that serves as a collective voice for students and advances the rights, interests, and welfare of students pursuing careers in audiology. ",
  "The Student Admission Volunteers work with the Admissions Department to assist prospective students when they visit Northwestern. ",
  "Student Affairs affects every Northwestern student. Nearly 30 departments make up the Division of Student Affairs, from housing to food services, career services to counseling, the student center to student org advising, and so much more. ",
  "Student Affairs Information Technology - IT Support and Development for the Division or Student Affairs.",
  "The Student Affairs Marketing department is responsible for establishing the Division of Student Affairs brand as well as assisting each department within the division with developing and implementing integrated marketing communication plans. ",
  "The SAB is the overarching student government organization within the School of Professional Studies. ",
  "SAFE's goal is to build a totally inclusive, non-selective organization for anybody interested in investing or working in the financial services industry, placing an emphasis on growth and education.",
  "IEEE NU exists to provide all students at Northwestern University with an avenue for participating in events and activities that promote the disciplines within the Department of Electrical Engineering and Computer Science.",
  "We are a community service organization that provides free strategic consulting services to local non-profits.",
  "The Student Organization Finance Office (SOFO) serves  as the banking center for all student groups recognized by  Northwestern  University. As such, it facilitates financial transactions  and offers an  independent and verifiable record of all the ",
  "Student Organizations & Activities seeks to engage students in involvement opportunities that build a sense of belonging and community at Northwestern University. ",
  "The Student Philanthropy Council (SPC) provides a student voice to philanthropy programming at Northwestern. The Council meets monthly to plan, discuss, and execute Student Philanthropy education and programming opportunities.",
  "The Northwestern Student Theatre Coalition, or StuCo for short, is a collective of nine student theatre groups and two dance groups, each with its own executive board and mainstage performance series.",
  "Students for Ecological and Environmental Development (SEED) works to affect the state of the environment and to support progressive environmental movements at Northwestern University through event programming, service, education and advocacy.",
  "SJP is a diverse group of students, faculty, staff, and community members at universities throughout the US. Our group is organized according to democratic principles in order to promote justice, human rights, liberation and self-determination.",
  "Students for Sensible Drug Policy is an international grassroots network of students who advocate for ending the War on Drugs and educating our community about harm reduction and honest drug information.",
  "The mission of SPEAK for Change is to utilize activist efforts in order to challenge the normalization of sexual and interpersonal violence at Northwestern and in society at-large, as well as to foster a campus community in which survivors can thrive.",
  "Studio 22 is a student-run production company that exists to provide extracurricular filmmaking opportunities not offered in production classes. Studio 22 continually strives to promote education, ambition, and quality in Northwestern filmmakers.\r\n ",
  "TBA",
  "Supplies for Dreams is a 501(c)3 nonprofit organization that provides underprivileged Chicago Public School students with critical resources and extra-curricular opportunities ranging from basic school supplies to field trips and one-on-one mentoring. ",
  "Surf Club hopes to build a fun-loving and supportive community of student surfers! We will strive to give access to surfing equipment to as many students as possible, regardless of skill level.  ",
  "Sustained Dialogue (SD) is a student-facilitated program that encourages conversation across lines of difference. Students participate in weekly 90-minute sessions throughout the quarter in which they explore issues around their social identities.",
  "Swing Left introduces Northwestern students to the most effective voter contact opportunities to elect Democrats up and down the ballot in key states across the country. ",
  "Swipe Out Hunger NU is part of a national organization that works towards ending food insecurity on college campuses through student donations of unused dining dollars, educational opportunities, and community service events.",
  "We aim to facilitate tabletop roleplaying at NU by providing everyone the opportunity to learn, explore, and enjoy the hobby in an inclusive, friendly environment. Join our discord! https://discord.gg/TdRKybf",
  "A Taiwanese-American student interest group striving to promote cultural awareness through educational events like Taiwanese Night Market, Karaoke Night, Dragon Boat Festival, Celebrasia, and more.",
  "TAMID at Northwestern provides students the opportunity to gain exposure to the fields of consulting, investment management, venture capital, entrepreneurship and technology innovation by learning from industry leaders and consulting for Israeli startups",
  "A Neo-futurism inspired performance group",
  "The mission of Team Enough and its chapters is to create a safer America by ending America's gun violence epidemic. This Northwestern chapter aims to engage students in advocacy work towards raising awareness and ending the gun violence epidemic.",
  "TEDxNorthwesternU is an independently organized TEDx conference held annually at Northwestern University.  The organizing team is comprised of undergraduate students representing all of Northwestern's undergraduate schools and colleges.",
  "Tempo Tantrum is Northwestern's newest low-voiced a cappella sensation!  Our mission is to bring a new and unique voice to Northwestern's thriving a cappella community and beyond.",
  "We are student group aimed to promote cross-cultural dialogue, awareness of situations where cultural sensitivity is important, so that students from different backgrounds can have good conversations together.",
  "Thai Club is an organization comprised of Thai international students, Thai Americans, and anyone interested in Thai culture. Our activities include the Southeast Asian Night in winter quarter and Thai Night in the spring.",
  "A collective of producers, performers, and artists at Northwestern University.",
  "THE BIX is a comedy improv group at Northwestern University focused on, but not limited to, musical improvisation. \r\nNot a singer? Not a problem!",
  "The Blackout is Northwestern's premiere late-night comedy show. Drawing inspiration from \"The Late Show with Stephen Colbert\" & \"Jimmy Kimmel! Live!\", The Blackout utilizes the structure of a late-night talk show and infuses it with Northwestern humor. ",
  "CKNU collects over 30,000 lbs of excess food from NU dining halls each year that would otherwise be thrown away. We package the food into healthy meals and deliver them to low-income Evanston residents.",
  "The Collective aims to support black men by creating a community on campus. Although The Collective\\u2019s primary mission is to provide a space for black men to foster thoughtful conversation, the group is open to any student that identifies as a black male.",
  "One of the nation's oldest and most respected college newspapers, The Daily Northwestern has won dozens of regional and national awards and has been publishing since 1871. Both print and online publications are produced entirely by students. ",
  "The Deep End is a filmed show produced each quarter that exists at the intersection of comedy and journalism.\r\n",
  "We are a faith-based community for Chinese-speaking students on campus. Our mission is to share our Christian faith and provide a healthy supportive environment for Northwestern students to grow academically, mentally, and spiritually. ",
  "The mission of The Graduate School of Northwestern University is: to be a trusted, responsive, and visionary leader and partner in order to maintain and promote the highest quality master\\u2019s and doctoral education.\r\n\r\n",
  "The Medical Decoder is a student-produced publication run by, and designed for, those interested in the world of medicine and health care. ",
  "The Mindfulness Club is a group of students interested in promoting mindfulness on campus and developing a daily practice. ",
  "The Panini Players are a theatre ensemble dedicated to bringing the classical style of Commedia dell'Arte to campus. Commedia is distinctive for its use of masks,  stock characters, physical comedy and improvisation. ",
  "N/A",
  "The Slam Society seeks to provide an open and welcoming environment for poets of all levels of experience to write, perform, learn, and grow.",
  "tba",
  "The Subcontinent Project aims to foster meaningful conversations among the Northwestern and Chicagoland community by organizing events pertaining to South Asian issues.",
  "Welcome to The Underground Lectures, where we give current NU students the chance to exchange TED Talk-style lectures about any topic that fascinates them. If you have something to teach, then we have something to learn\\u2014and vice-versa.",
  "A cappella group from Northwestern University. We sing and laugh while keeping the love and silliness alive.",
  "The Waa-Mu Show is Northwestern University's own original musical, written, performed, and presented by Northwestern students. ",
  "The Women\\u2019s Network is a networking organization that celebrates ambition and connects women to fellow high-achieving, noncompetitive peers on their respective college campuses and to seasoned female professionals in various fields.",
  "Theme Park Engineering & Design Group (TPED) is a multidisciplinary design club for themed entertainment enthusiasts from all backgrounds! \r\n\r\n\r\n",
  "This We Believe Northwestern is an initiative where students, staff, and faculty come together to share a meal and create belief statements reflecting on an aspect of their personal philosophy.\r\n",
  "THUNK a cappella is Northwestern's premier co-ed a cappella group. They have been singing and wearing hot black on campus since 1993. The group is comprised of 19 members, entirely student directed. They perform on campus and in the Chicago area.",
  "TONIK Tap is Northwestern's premier tap dance company. We come from all over  but we all have one thing in common -- we love to make rhythm! As a completely student-run group, we perform all over campus and Chicagoland.",
  "Go check out our main website: \r\n http://sites.northwestern.edu/runners/",
  "Our goal is to help Northwestern students find groups to play trading card games, help them develop as trading card game players, and to provide an inclusive environment in which new and seasoned players alike can play trading card games together.",
  "As the only Northwestern group of its kind, TSO aims to cultivate a dynamic and supportive community of transfer students. We hope to overcome any challenges standing in the way of transfer integration into Northwestern, especially the incoming class.",
  "Treblemakers is Northwestern\\u2019s East-Asian interest a cappella group and welcomes all identities. We sing everything from mainstream American pop, to jazzy Asian ballads, to mashups featuring the best of both worlds.\r\nLink: https://linktr.ee/Nutreble",
  "Tufan Entertainment is a student led non-profit organization that presents talented South Asian performers from across the country in an intercollegiate dance competition to raise funds for a school in India and a 2nd local beneficiary. ",
  "Typhoon Dance Troupe is a student organized dance group that highlights popular and classical dances of East and Southeast Asia. Through work of art, we dedicate ourselves to displaying pieces of the regions' rich and diverse culture.",
  "The purpose of Ukulele club is to teach people how to play ukulele, and to help people who already know how to play the ukulele improve. Additionally, our goal is to foster an accepting and welcoming environment where people can jam with friends.",
  "The UCC welcomes students of all majors who are interested in chemistry! We put together chemistry-related events each quarter as well as campus-wide chemistry events such as the Halloween show and liquid nitrogen ice cream social!",
  "The Undergraduate Economics Society is a group for undergraduate economics majors, and others interested in economics and business. We hold a variety of events to increase resources and to enrich students\\u2019 experiences at Northwestern. ",
  "The Undergraduate Premedical Society at Northwestern University (UPS) is an organization designed to provide premedical students with resources and opportunities as they plan to apply to medical school.  Contact: premednu@gmail.com",
  "Our student group works closely with the Northwestern Prison Education Program (NPEP) to develop prison education initiatives at Stateville Correctional Center and Cook County Department of Corrections",
  "The Undergraduate Psychology Association (UPA) is a group of psychology students who are dedicated to helping all students with an interest in psychology. UPA sponsors academic, social, and community service events during the school year to help ",
  "URSA is the Undergraduate Radio/Television/Film Student Association. It is made up of 10 student representatives in the Radio/TV/Film department. We act as the liaison between the student body and the faculty. ",
  "UREC will seek to connect interested undergraduate students to all facets of the real estate industry. Members of our club will gain exposure to the field through Chicago site visits, skill building workshops, networking events, and more.",
  "UNICEF NU is an organization that aims to educate, advocate and fundraise on behalf of UNICEF. ",
  "\"UWC makes education a force to unite people, nations and cultures for peace and a sustainable future.\"\r\nPeople who recognize or who are interested in this mission statement are welcome to join!",
  "UNITY Charity Fashion Show is an annual event sponsored by diverse student groups from across campus. Together, students from all backgrounds come together for their love of fashion and raise money for a different charity every year.",
  "UBF is a nondenominational, evangelical fellowship with one-to-one and group Bible studies, reflection sharing, Sunday worship, and conferences. One-to-one Bible studies are flexible appointments; students can determine location and time. Email for info.",
  "UCM is an ecumenical and queer-affirming campus ministry at Northwestern University. We are sponsored by the United Methodist Church and the Presbyterian Church (USA), but we welcome all!",
  "University Special Interest is a label for student organizations related to Northwestern University (i.e. The Northwestern Daily, NU Channel 1, etc.).",
  "TBA",
  "Vertigo is an executive student theatre board that produces 6+ shows a year that are written by fellow undergraduate students.Want to learn more? Check out our website at http://www.vertigoplays.org/ or reach out to marianareyes@u.northwetsern.edu",
  "VSA exists in order to promote awareness of and appreciation for Vietnamese and Vietnamese-American culture and history.  You do not have to be Vietnamese to join! We are actively seeking new members, and currently offer junior exec positions!",
  "WATCH is a group of peer health educators operating under the guidance of Health Promotion and Wellness (HPaW). Our aim is to improve the health and well-being of individuals and the Northwestern community as a whole.",
  "WAVE Productions exists to share the stories of the past and present in order to open the door to a better future. Thus, the events we do are not limited to a single form or theme - we are excited about the art our collaborators are excited about!",
  "Our organization mainly hosts \\u2018The Werewolves of Millers Hollow\\u2019 (\\u2018Werewolves\\u2019 in shorthand), which is a strategic board game involving 8 and 18 players debating.",
  "Wild Roots is a student-directed garden that grows fresh produce for the Northwestern and Evanston communities using sustainable practices.",
  "Wildcat Connection is the directory for student organizations, campus departments, fraternity/sorority chapters, and more.",
  "Be a Part of Wildcat Welcome!\r\nFreshmen, Sophomores and Juniors Can Apply to Be on the Wildcat Welcome Staff!\r\nThe Office of New Student and Family Programs relies heavily on student volunteers to plan and execute Wildcat Welcome and more!",
  "Wildcats for Israel is Northwestern's pro-Israel group on campus that strives to advocate, educate and discuss all topics concerning Israel including culture, politics, and history.",
  "The mission of Wildchat is to provide all Northwestern students, regardless of race, religion, ethnicity, ability, sexual orientation or gender representation, with a free, confidential peer listening service.",
  "A student organization dedicated to promoting wildlife conservation and appreciation on campus",
  "Willard Residential College is on south campus and houses 290 students in single- and double-occupancy and a very limited number of triple-occupancy rooms, arranged in a traditional-style layout. Men and women are clustered by gender on the same floor.",
  "WNUR is Northwestern's student radio- but it's much more than just college radio. WNUR is a non-commercial, listener-supported radio station broadcasting at a frequency of 89.3 MHz FM and a power of 7200 watts. WNUR has broadcasted since 1950.",
  "Women in Business (WIB) is an open-entry organization established to provide business-minded female-identifying individuals with the background and network to support them in their professional endeavors.",
  "WiC\\u00a0fosters a community for and promotes the professional development of women who share an interest in technology. WiC offers weekly hack nights, tech talks with corporate & academic professionals, volunteering opportunities, and a mentorship program.",
  "Women In Leadership is a program that builds connections between women leaders so that women can make a difference in the professional life, personal life and community.",
  "WiPhi is a group of women and female-identifying individuals from all levels of Northwestern academia. Undergraduates, graduate students, and faculty get together over snacks and drinks to discuss philosophy every other week. ",
  "The Women in Philosophy Workshop seeks to increase the visibility and relevance of women in philosophy by showcasing their work in a supportive and inclusive environment.  ",
  "Women in Science and Engineering Research (WISER) works towards building community among graduate women in STEM, advancing women's leadership in STEM, and developing professional skills through workshops & seminars for early-career women in the sciences.",
  "The Northwestern University Women's Center is dedicated to fostering a campus climate that promotes equity and enriches the personal, professional and academic lives of all members of the University community. ",
  "NU women's club Lacrosse is a fun and competitive atmosphere.  The women all played in high school and couldn't bear to give it up in college.\r\n \r\nWe practice about twice a week and play in 3-4 tournaments throughout the year.",
  "The Women's Club soccer team is part of the Women's Midwest Alliance Soccer Club (W-MASC) League.  We play competitively against teams in the Great Lakes region. The Fall season begins in September and ends at the end of October.",
  "The Women's Club Volleyball team is a competitive athletic opportunity. Our team has anywhere from 15-20 members depending on positions and lineups. Typically we travel to 3 tournaments per quarter. Work hard, play hard, have fun!",
  "Since the club was founded in Spring 1999, its membership and competitiveness have continued to grow. As a member of the Chicago Area Rugby Football Union (CARFU) with six other women's collegiate teams, NU has become an annual competitor for the league.",
  "Claw is Northwestern's womxn's Ultimate frisbee team. We welcome all skill levels! We have a competitive A team and a developmental B team.",
  "Womxn in Economics (WiE) is a group of undergraduate students which seeks to encourage female-identifying members of the NU community to pursue their interests in economics, and to support them as they do so.",
  "Women in Law is an organization dedicated to empowering women and non-binary individuals on campus to pursue their career goals in the legal field.  ",
  "Northwestern University World Cup (NUWC) is Northwestern\\u2019s largest student-run athletic event, bringing together over 750 students from all backgrounds through the love of the beautiful game of soccer. ",
  "The X-Factors are a co-ed group of singers who love having fun and singing awesome a cappella music. We've recorded six CDs and will be releasing another this year! We can't wait for our winter 2019 tour!",
  "YDSA is a hub for progressives and leftists at Northwestern. We discuss leftist politics as well as provide a space for organizing and activism on campus in order to build a progressive future. ",
  "Young Life is a non-denominational Christian outreach to high school and middle school students. Young Life leadership is an opportunity for Northwestern students to serve as volunteer leaders and grow in community together.",
  "Zen Club gives students the opportunity to meditate in a group environment, and talk about meditating, daily life, as well as more philosophical inquiries. Each meeting consists of a meditation, followed by tea and discussion (with a veteran Zen monk!)",
  "Gamma Chapter, Northwestern University 576 Lincoln St.\r\nInstalled December 5, 1976\r\n\"A Powerhouse of Excellence.\"\r\nChapter President: Jeffrey Eisenband\r\n",
  "Nu Sigma Chapter, Northwestern University\r\nInstalled August 28, 2005\r\n\"A Community-Conscious, Action-Oriented Organization.\"\r\nChapter President: Brittany Owens\r\n\r\nOrganization Facts\r\nNational founding date: January 16, 1920\r\nColors: Royal Blue, White",
  "Alpha Phi Chapter, Northwestern University 710 Emerson Street\r\nInstalled November 17, 1923\r\n\"Seek the Noblest.\"\r\nChapter President: Gina Livecchi\r\nYou may visit the Alpha Phi Chapter's website at  http://northwestern.zetataualpha.org"
]
